[Killed] LogicalOperator
src/discount.js:3:5
 function calculateDiscount(order) {
   if (
-    !order ||
-    typeof order.totalAmount !== "number" ||
-    order.totalAmount <= 0
+    (!order || typeof order.totalAmount !== "number") && order.totalAmount <= 0
   ) {
     throw new Error("Invalid order data!");
killedBy: calculateDiscount throws error when totalAmount is exactly 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid order data!"

Received function did not throw

[Killed] ConditionalExpression
src/discount.js:3:5
 function calculateDiscount(order) {
   if (
-    !order ||
-    typeof order.totalAmount !== "number" ||
+    false ||
     order.totalAmount <= 0
   ) {
killedBy: calculateDiscount throws error when totalAmount is a string
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid order data!"

Received function did not throw

[Killed] ConditionalExpression
src/discount.js:4:5
 function calculateDiscount(order) {
   if (
     !order ||
-    typeof order.totalAmount !== "number" ||
+    false ||
     order.totalAmount <= 0
   ) {
killedBy: calculateDiscount throws error when totalAmount is a string
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid order data!"

Received function did not throw

[Killed] EqualityOperator
src/discount.js:4:5
 function calculateDiscount(order) {
   if (
     !order ||
-    typeof order.totalAmount !== "number" ||
+    typeof order.totalAmount === "number" ||
     order.totalAmount <= 0
   ) {
killedBy: calculateDiscount no discount for orders under 100
statusReason: Error: Invalid order data!

[Killed] EqualityOperator
src/discount.js:5:5
   if (
     !order ||
     typeof order.totalAmount !== "number" ||
-    order.totalAmount <= 0
+    order.totalAmount > 0
   ) {
     throw new Error("Invalid order data!");
killedBy: calculateDiscount no discount for orders under 100
statusReason: Error: Invalid order data!

[Killed] ConditionalExpression
src/discount.js:5:5
   if (
     !order ||
     typeof order.totalAmount !== "number" ||
-    order.totalAmount <= 0
+    false
   ) {
     throw new Error("Invalid order data!");
killedBy: calculateDiscount throws error when totalAmount is exactly 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid order data!"

Received function did not throw

[Killed] BlockStatement
src/discount.js:6:5
     !order ||
     typeof order.totalAmount !== "number" ||
     order.totalAmount <= 0
-  ) {
-    throw new Error("Invalid order data!");
-  }
+  ) {}
 
   let discountRate = 0;
killedBy: calculateDiscount throws error when totalAmount is exactly 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid order data!"

Received function did not throw

[Killed] StringLiteral
src/discount.js:7:21
     typeof order.totalAmount !== "number" ||
     order.totalAmount <= 0
   ) {
-    throw new Error("Invalid order data!");
+    throw new Error("");
   }
 
killedBy: calculateDiscount throws error when totalAmount is exactly 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid order data!"
Received message:   ""

      56 |       } else {
      57 |         stryCov_9fa48("13");
    > 58 |         throw new Error(stryMutAct_9fa48("14") ? "" : (stryCov_9fa48("14"), "Invalid order data!"));

[Killed] ConditionalExpression
src/discount.js:12:7
 
   let discountRate = 0;
 
-  if (order.totalAmount >= 100) {
+  if (false) {
     switch (order.customerType) {
       case "gold":
killedBy: calculateDiscount standard customer over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0

[Killed] EqualityOperator
src/discount.js:12:7
 
   let discountRate = 0;
 
-  if (order.totalAmount >= 100) {
+  if (order.totalAmount < 100) {
     switch (order.customerType) {
       case "gold":
killedBy: calculateDiscount no discount for orders under 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 15

[Killed] ConditionalExpression
src/discount.js:14:7
 
   if (order.totalAmount >= 100) {
     switch (order.customerType) {
-      case "gold":
-        discountRate += 0.15;
-        break;
+      case "gold":
       case "silver":
         discountRate += 0.1;
killedBy: calculateDiscount gold customer over 100 with couponand many items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 100

[Killed] StringLiteral
src/discount.js:14:12
 
   if (order.totalAmount >= 100) {
     switch (order.customerType) {
-      case "gold":
+      case "":
         discountRate += 0.15;
         break;
killedBy: calculateDiscount gold customer over 100 with couponand many items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 50

[Killed] AssignmentOperator
src/discount.js:15:9
   if (order.totalAmount >= 100) {
     switch (order.customerType) {
       case "gold":
-        discountRate += 0.15;
+        discountRate -= 0.15;
         break;
       case "silver":
killedBy: calculateDiscount gold customer over 100 with couponand many items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: -25

[Killed] ConditionalExpression
src/discount.js:17:7
       case "gold":
         discountRate += 0.15;
         break;
-      case "silver":
-        discountRate += 0.1;
-        break;
+      case "silver":
       case "standard":
         discountRate += 0.05;
killedBy: calculateDiscount silver customer over 100 => 10% discount 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 10

[Killed] StringLiteral
src/discount.js:17:12
       case "gold":
         discountRate += 0.15;
         break;
-      case "silver":
+      case "":
         discountRate += 0.1;
         break;
killedBy: calculateDiscount silver customer over 100 => 10% discount 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 0

[Killed] AssignmentOperator
src/discount.js:18:9
         discountRate += 0.15;
         break;
       case "silver":
-        discountRate += 0.1;
+        discountRate -= 0.1;
         break;
       case "standard":
killedBy: calculateDiscount silver customer over 100 => 10% discount 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: -20

[Killed] ConditionalExpression
src/discount.js:20:7
       case "silver":
         discountRate += 0.1;
         break;
-      case "standard":
-        discountRate += 0.05;
-        break;
+      case "standard":
     }
 
killedBy: calculateDiscount standard customer over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0

[Killed] AssignmentOperator
src/discount.js:21:9
         discountRate += 0.1;
         break;
       case "standard":
-        discountRate += 0.05;
+        discountRate -= 0.05;
         break;
     }
killedBy: calculateDiscount standard customer over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: -10

[Killed] ConditionalExpression
src/discount.js:25:9
         break;
     }
 
-    if (order.hasCoupon) {
+    if (false) {
       discountRate += 0.05;
     }
killedBy: calculateDiscount gold customer over 100 with couponand many items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 100

[Killed] ConditionalExpression
src/discount.js:25:9
         break;
     }
 
-    if (order.hasCoupon) {
+    if (true) {
       discountRate += 0.05;
     }
killedBy: calculateDiscount standard customer over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 20

[Killed] AssignmentOperator
src/discount.js:26:7
     }
 
     if (order.hasCoupon) {
-      discountRate += 0.05;
+      discountRate -= 0.05;
     }
 
killedBy: calculateDiscount gold customer over 100 with couponand many items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 75

[Killed] EqualityOperator
src/discount.js:29:9
       discountRate += 0.05;
     }
 
-    if (order.items >= 10) {
+    if (order.items > 10) {
       discountRate += 0.05;
     }
killedBy: calculateDiscount items exactly 10 should trigger discount 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 30

[Killed] ConditionalExpression
src/discount.js:29:9
       discountRate += 0.05;
     }
 
-    if (order.items >= 10) {
+    if (true) {
       discountRate += 0.05;
     }
killedBy: calculateDiscount standard customer over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 20

[Killed] AssignmentOperator
src/discount.js:30:7
     }
 
     if (order.items >= 10) {
-      discountRate += 0.05;
+      discountRate -= 0.05;
     }
 
killedBy: calculateDiscount gold customer over 100 with couponand many items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 75

[Killed] ConditionalExpression
src/discount.js:33:9
       discountRate += 0.05;
     }
 
-    if (order.forceExtra) {
+    if (false) {
       discountRate += 0.1;
     }
killedBy: calculateDiscount discount capped at 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 300
Received: 250

[Killed] BlockStatement
src/discount.js:33:27
       discountRate += 0.05;
     }
 
-    if (order.forceExtra) {
-      discountRate += 0.1;
-    }
+    if (order.forceExtra) {}
     if (discountRate > 0.3) {
       discountRate = 0.3;
killedBy: calculateDiscount discount capped at 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 300
Received: 250

[Killed] AssignmentOperator
src/discount.js:34:7
     }
 
     if (order.forceExtra) {
-      discountRate += 0.1;
+      discountRate -= 0.1;
     }
     if (discountRate > 0.3) {
killedBy: calculateDiscount discount capped at 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 300
Received: 150

[Killed] BlockStatement
src/discount.js:36:29
     if (order.forceExtra) {
       discountRate += 0.1;
     }
-    if (discountRate > 0.3) {
-      discountRate = 0.3;
-    }
+    if (discountRate > 0.3) {}
   }
 
killedBy: calculateDiscount discount capped at 30%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 300
Received: 350

[Killed] EqualityOperator
src/discount.js:36:9
     if (order.forceExtra) {
       discountRate += 0.1;
     }
-    if (discountRate > 0.3) {
+    if (discountRate <= 0.3) {
       discountRate = 0.3;
     }
killedBy: calculateDiscount standard customer over 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 60

[Killed] UnaryOperator
src/discount.js:41:10
     }
   }
 
-  return +(order.totalAmount * discountRate).toFixed(2);
+  return -(order.totalAmount * discountRate).toFixed(2);
 }
 
killedBy: calculateDiscount no discount for orders under 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -0

[Killed] ArithmeticOperator
src/discount.js:41:12
     }
   }
 
-  return +(order.totalAmount * discountRate).toFixed(2);
+  return +(order.totalAmount / discountRate).toFixed(2);
 }
 
killedBy: calculateDiscount no discount for orders under 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: Infinity

[Killed] ObjectLiteral
src/discount.js:44:18
   return +(order.totalAmount * discountRate).toFixed(2);
 }
 
-module.exports = { calculateDiscount };
+module.exports = {};
 
killedBy: calculateDiscount no discount for orders under 100
statusReason: TypeError: calculateDiscount is not a function
